% clc;clear;close all
% load x_est_bio_FISTA x
% 
% 
% disp('Please select the modulation area ...')
% figure
% [temp,rect_aoi] = imcrop(angle(gather(x)));
% if rem(size(temp,1),2) == 1
%     rect_aoi(4) = rect_aoi(4) - 1;
% end
% if rem(size(temp,2),2) == 1
%     rect_aoi(3) = rect_aoi(3) - 1;
% end
% close
% disp('Selected.')
% 
% AngleX = imcrop(angle(gather(x)),rect_aoi);
% 
% phase1=DCTJBG(AngleX);
% figure
% imagesc(phase1)
% 
%  [c,Iout]=zernike_fit80(AngleX,ones(size(AngleX)));
% 
% figure
% subplot(131)
% imagesc(phase1)
% subplot(132)
% imagesc(Iout)
% subplot(133)
% imagesc(phase1-Iout);colormap(sinebow(256))



%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%81项Zernike多项式拟合；输入被拟合波面I（不含NaN）;对应的mask（n*n，0,1矩阵）
%ZMY 2013/12/8
function [c,Iout]=zernike_fit80(I,mask)
% I为输入波面；mask为有效像素掩膜板。
% c为80项泽尼克系数；Iout为拟合波面。
%

%将波面转化到极坐标系下
I=double(I);
[w,r,t]=wrt(I,mask);

%拟合
[c,I1]=Zernike_fit(w,r,t);
Iout=I;
Iout(mask==1)=I1(:);

%显示
% figure,subplot(1,2,1);imshow(I,[]);
% subplot(1,2,2);imshow(Iout,[]);
end
%%% 子函数 %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function [W,R,T]=wrt(wave,mask)
%坐标系变换
%获得圆心和极坐标系下坐标

[M,N]=size(wave);
[X,Y]=meshgrid(1:N,1:M);
NM=regionprops(mask,'Centroid');
nm=NM.Centroid;
nn=round(nm(1));
mm=round(nm(2));
Rmax=sum(max(mask))/2;
X=(X-nn)./Rmax;
Y=(Y-mm)./Rmax;
[th,r]=cart2pol(X,Y);
T=(th(mask==1))';
R=(r(mask==1))';
W=(wave(mask==1))';
end
%------------------------------------------------------------------------%
function [aj,WW]=Zernike_fit(W,r,th)
%使用前35项泽尼克多项式拟合，输入波面向量W，采样点的座标向量r和th;
%特别注意参数W，r，th必须是行向量
%返回一组多项式系数向量,根据泽尼克多项式的特性，拟合的波面必须是圆形孔径的；

Sik=Zernike_poly(r',th');
%计算协方差矩阵
Aij=Sik*Sik';
qsk=W-mean(W);
Ain=Sik*qsk';
%通过协方差矩阵得到多项式系数
aj=Aij\Ain;
WW=(Sik'*aj)';
end
%------------------------------------------------------------------------%
function sj=Zernike_poly(r,th)
%用于计算点（r，th）在泽尼克多项式各个基面上的值，作为一组行向量返回，不含常数项
%r，th为矩阵

%初始化
M=size(r);
sj=zeros(80,M(1),M(2));

%前35项zernike多项式
% si(0)=1;
sj(1,:,:)=r.*cos(th);            %y    y方向倾斜
sj(2,:,:)=r.*sin(th);            %x    x方向倾斜
sj(3,:,:)=2*r.^2-1;              %-1+2*y.^2+2*x.^2     离焦 
sj(4,:,:)=r.^2.*cos(2*th);       %y.^2-x.^2    像散    轴线方向为0度或90度
sj(5,:,:)=r.^2.*sin(2*th);       %2xy      像散      轴线方向为正负45度
sj(6,:,:)=(3*r.^3-2*r).*cos(th); %-2y+3y.^3+3*x.^2*y     沿y轴的三级彗差
sj(7,:,:)=(3*r.^3-2*r).*sin(th); %-2x+3x.^3+3*y.^2*x     沿x轴的三级彗差
sj(8,:,:)=6*r.^4-6*r.^2+1;       %1-6*y.^2-6*x.^2+6*y.^4+12*x.^2*y.^2+6*x.^4    三级球差
sj(9,:,:)=r.^3.*cos(3*th);
sj(10,:,:)=r.^3.*sin(3*th);
sj(11,:,:)=(4*r.^4-3*r.^2).*cos(2*th);
sj(12,:,:)=(4*r.^4-3*r.^2).*sin(2*th);
sj(13,:,:)=(10*r.^5-12*r.^3+3*r).*cos(th);
sj(14,:,:)=(10*r.^5-12*r.^3+3*r).*sin(th);
sj(15,:,:)=20*r.^6-30*r.^4+12*r.^2-1;
sj(16,:,:)=r.^4.*cos(4*th);
sj(17,:,:)=r.^4.*sin(4*th);
sj(18,:,:)=(5*r.^5-4*r.^3).*cos(3*th);
sj(19,:,:)=(5*r.^5-4*r.^3).*sin(3*th);
sj(20,:,:)=(15*r.^6-20*r.^4+6*r.^2).*cos(2*th);
sj(21,:,:)=(15*r.^6-20*r.^4+6*r.^2).*sin(2*th);
sj(22,:,:)=(35*r.^7-60*r.^5+30*r.^3-4*r).*cos(th);
sj(23,:,:)=(35*r.^7-60*r.^5+30*r.^3-4*r).*sin(th);
sj(24,:,:)=70*r.^8-140*r.^6+90*r.^4-20*r.^2+1;
sj(25,:,:)=r.^5.*cos(5*th);
sj(26,:,:)=r.^5.*sin(5*th);
sj(27,:,:)=(6*r.^6-5*r.^4).*cos(4*th);
sj(28,:,:)=(6*r.^6-5*r.^4).*sin(4*th);
sj(29,:,:)=(21*r.^4-30*r.^2+10).*r.^3.*cos(3*th);
sj(30,:,:)=(21*r.^4-30*r.^2+10).*r.^3.*sin(3*th);
sj(31,:,:)=(56*r.^6-105*r.^4+60*r.^2-10).*r.^2.*cos(2*th);
sj(32,:,:)=(56*r.^6-105*r.^4+60*r.^2-10).*r.^2.*sin(2*th);
sj(33,:,:)=(126*r.^8-280*r.^6+210*r.^4-60*r.^2+5).*r.*cos(th);
sj(34,:,:)=(126*r.^8-280*r.^6+210*r.^4-60*r.^2+5).*r.*sin(th);
sj(35,:,:)=252*r.^10-630*r.^8+560*r.^6-210*r.^4+30*r.^2-1;
sj(36,:,:)=r.^6.*cos(6.*th);
sj(37,:,:)=r.^6.*sin(6.*th);
sj(38,:,:)=-cos(5.*th).*(- 7.*r.^7 + 6.*r.^5);
sj(39,:,:)=-sin(5.*th).*(- 7.*r.^7 + 6.*r.^5);
sj(40,:,:)=cos(4.*th).*(28.*r.^8 - 42.*r.^6 + 15.*r.^4);
sj(41,:,:)=sin(4.*th).*(28.*r.^8 - 42.*r.^6 + 15.*r.^4);
sj(42,:,:)=-cos(3.*th).*(- 84.*r.^9 + 168.*r.^7 - 105.*r.^5 + 20.*r.^3);
sj(43,:,:)=-sin(3.*th).*(- 84.*r.^9 + 168.*r.^7 - 105.*r.^5 + 20.*r.^3);
sj(44,:,:)=cos(2.*th).*(210.*r.^10 - 504.*r.^8 + 420.*r.^6 - 140.*r.^4 + 15.*r.^2);
sj(45,:,:)=sin(2.*th).*(210.*r.^10 - 504.*r.^8 + 420.*r.^6 - 140.*r.^4 + 15.*r.^2);
sj(46,:,:)=-cos(th).*(- 462.*r.^11 + 1260.*r.^9 - 1260.*r.^7 + 560.*r.^5 - 105.*r.^3 + 6.*r);
sj(47,:,:)=-sin(th).*(- 462.*r.^11 + 1260.*r.^9 - 1260.*r.^7 + 560.*r.^5 - 105.*r.^3 + 6.*r);
sj(48,:,:)=924.*r.^12 - 2772.*r.^10 + 3150.*r.^8 - 1680.*r.^6 + 420.*r.^4 - 42.*r.^2 + 1;
sj(49,:,:)=r.^7.*cos(7.*th);
sj(50,:,:)=r.^7.*sin(7.*th);
sj(51,:,:)=-cos(6.*th).*(- 8.*r.^8 + 7.*r.^6);
sj(52,:,:)=-sin(6.*th).*(- 8.*r.^8 + 7.*r.^6);
sj(53,:,:)=cos(5.*th).*(36.*r.^9 - 56.*r.^7 + 21.*r.^5);
sj(54,:,:)=sin(5.*th).*(36.*r.^9 - 56.*r.^7 + 21.*r.^5);
sj(55,:,:)=-cos(4.*th).*(- 120.*r.^10 + 252.*r.^8 - 168.*r.^6 + 35.*r.^4);
sj(56,:,:)=-sin(4.*th).*(- 120.*r.^10 + 252.*r.^8 - 168.*r.^6 + 35.*r.^4);
sj(57,:,:)=cos(3.*th).*(330.*r.^11 - 840.*r.^9 + 756.*r.^7 - 280.*r.^5 + 35.*r.^3);
sj(58,:,:)=sin(3.*th).*(330.*r.^11 - 840.*r.^9 + 756.*r.^7 - 280.*r.^5 + 35.*r.^3);
sj(59,:,:)=-cos(2.*th).*(- 792.*r.^12 + 2310.*r.^10 - 2520.*r.^8 + 1260.*r.^6 - 280.*r.^4 + 21.*r.^2);
sj(60,:,:)=-sin(2.*th).*(- 792.*r.^12 + 2310.*r.^10 - 2520.*r.^8 + 1260.*r.^6 - 280.*r.^4 + 21.*r.^2);
sj(61,:,:)=cos(th).*(1716.*r.^13 - 5544.*r.^11 + 6930.*r.^9 - 4200.*r.^7 + 1260.*r.^5 - 168.*r.^3 + 7.*r);
sj(62,:,:)=sin(th).*(1716.*r.^13 - 5544.*r.^11 + 6930.*r.^9 - 4200.*r.^7 + 1260.*r.^5 - 168.*r.^3 + 7.*r);
sj(63,:,:)=3432.*r.^14 - 12012.*r.^12 + 16632.*r.^10 - 11550.*r.^8 + 4200.*r.^6 - 756.*r.^4 + 56.*r.^2 - 1;
sj(64,:,:)=r.^8.*cos(8.*th);
sj(65,:,:)=r.^8.*sin(8.*th);
sj(66,:,:)=-cos(7.*th).*(- 9.*r.^9 + 8.*r.^7);
sj(67,:,:)=-sin(7.*th).*(- 9.*r.^9 + 8.*r.^7);
sj(68,:,:)=cos(6.*th).*(45.*r.^10 - 72.*r.^8 + 28.*r.^6);
sj(69,:,:)=sin(6.*th).*(45.*r.^10 - 72.*r.^8 + 28.*r.^6);
sj(70,:,:)=-cos(5.*th).*(- 165.*r.^11 + 360.*r.^9 - 252.*r.^7 + 56.*r.^5);
sj(71,:,:)=-sin(5.*th).*(- 165.*r.^11 + 360.*r.^9 - 252.*r.^7 + 56.*r.^5);
sj(72,:,:)=cos(4.*th).*(495.*r.^12 - 1320.*r.^10 + 1260.*r.^8 - 504.*r.^6 + 70.*r.^4);
sj(73,:,:)=sin(4.*th).*(495.*r.^12 - 1320.*r.^10 + 1260.*r.^8 - 504.*r.^6 + 70.*r.^4);
sj(74,:,:)=-cos(3.*th).*(- 1287.*r.^13 + 3960.*r.^11 - 4620.*r.^9 + 2520.*r.^7 - 630.*r.^5 + 56.*r.^3);
sj(75,:,:)=-sin(3.*th).*(- 1287.*r.^13 + 3960.*r.^11 - 4620.*r.^9 + 2520.*r.^7 - 630.*r.^5 + 56.*r.^3);
sj(76,:,:)=cos(2.*th).*(3003.*r.^14 - 10296.*r.^12 + 13860.*r.^10 - 9240.*r.^8 + 3150.*r.^6 - 504.*r.^4 + 28.*r.^2);
sj(77,:,:)=sin(2.*th).*(3003.*r.^14 - 10296.*r.^12 + 13860.*r.^10 - 9240.*r.^8 + 3150.*r.^6 - 504.*r.^4 + 28.*r.^2);
sj(78,:,:)=-cos(th).*(- 6435.*r.^15 + 24024.*r.^13 - 36036.*r.^11 + 27720.*r.^9 - 11550.*r.^7 + 2520.*r.^5 - 252.*r.^3 + 8.*r);
sj(79,:,:)=-sin(th).*(- 6435.*r.^15 + 24024.*r.^13 - 36036.*r.^11 + 27720.*r.^9 - 11550.*r.^7 + 2520.*r.^5 - 252.*r.^3 + 8.*r);
sj(80,:,:)=12870.*r.^16 - 51480.*r.^14 + 84084.*r.^12 - 72072.*r.^10 + 34650.*r.^8 - 9240.*r.^6 + 1260.*r.^4 - 72.*r.^2 + 1;

end